{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv_1/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "conv_bn_1/gamma", "shape": [16], "dtype": "float32"}, {"name": "conv_bn_1/beta", "shape": [16], "dtype": "float32"}, {"name": "conv_bn_1/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "conv_bn_1/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "conv_2/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "conv_bn_2/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv_bn_2/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_bn_2/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv_bn_2/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv_bn_3/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv_bn_3/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_bn_3/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv_bn_3/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_4/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv_bn_4/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv_bn_4/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_bn_4/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv_bn_4/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_5/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv_bn_5/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_bn_5/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_bn_5/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_bn_5/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_6/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv_bn_6/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_bn_6/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_bn_6/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_bn_6/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_7/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv_bn_7/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_bn_7/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_bn_7/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_bn_7/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_8/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv_bn_8/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_bn_8/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_bn_8/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_bn_8/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_9/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv_bn_9/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_bn_9/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_bn_9/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_bn_9/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_10/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv_bn_10/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_bn_10/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_bn_10/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_bn_10/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_11/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv_bn_11/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_bn_11/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_bn_11/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_bn_11/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_12/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_12_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_12_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_12_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_12_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_12/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "conv_pw_12_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_12_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_12_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_12_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_13/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_13_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_13_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_13_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_13_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_13/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "conv_pw_13_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_13_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_13_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_13_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_14/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_14_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_14_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_14_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_14_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_14/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "conv_pw_14_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_14_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_14_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_14_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2d/kernel", "shape": [3, 3, 64, 16], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 128, 16], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 256, 16], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_9/kernel", "shape": [3, 3, 256, 16], "dtype": "float32"}, {"name": "conv2d_9/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 256, 32], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_10/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_10/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_11/kernel", "shape": [3, 3, 256, 32], "dtype": "float32"}, {"name": "conv2d_11/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_13/kernel", "shape": [3, 3, 48, 12], "dtype": "float32"}, {"name": "conv2d_13/bias", "shape": [12], "dtype": "float32"}, {"name": "conv2d_15/kernel", "shape": [3, 3, 48, 8], "dtype": "float32"}, {"name": "conv2d_15/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_17/kernel", "shape": [3, 3, 48, 8], "dtype": "float32"}, {"name": "conv2d_17/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_19/kernel", "shape": [3, 3, 48, 12], "dtype": "float32"}, {"name": "conv2d_19/bias", "shape": [12], "dtype": "float32"}, {"name": "conv2d_12/kernel", "shape": [3, 3, 48, 9], "dtype": "float32"}, {"name": "conv2d_12/bias", "shape": [9], "dtype": "float32"}, {"name": "conv2d_14/kernel", "shape": [3, 3, 48, 6], "dtype": "float32"}, {"name": "conv2d_14/bias", "shape": [6], "dtype": "float32"}, {"name": "conv2d_16/kernel", "shape": [3, 3, 48, 6], "dtype": "float32"}, {"name": "conv2d_16/bias", "shape": [6], "dtype": "float32"}, {"name": "conv2d_18/kernel", "shape": [3, 3, 48, 9], "dtype": "float32"}, {"name": "conv2d_18/bias", "shape": [9], "dtype": "float32"}]}]}